"""
Дано : x,yєR^3 . Знайти z=2x+3y=(2*a+3*m,2*b+3*n,2*c+3*v) .
"""
# 0
'''
x- вектор x(a,b,c) float
y- вектор y(m,n,v) float
z- вектор z(i,o,p)результат 
'''
# Введення
a = float(input('Введіть координату а :'))
b = float(input('Введіть координату b :'))
c = float(input('Введіть координату c :'))
m = float(input('Введіть координату m :'))
n = float(input('Введіть координату n :'))
v = float(input('Введіть координату v :'))
# Обчислення
i = (2*a)+(3*m)
o = (2*b)+(3*n)
p = (2*c)+(3*v)
# Виведення
print('z({0}; {1}; {2})'.format(i, o, p))
